from utils.custom_interpolates import *

# Данные для линейной интерполяции
tab_linear = [[15.3, 26.8, 38.4, 49.9, 61.5, 73], [0.157, 0.258, 0.469, 0.607, 0.763, 0.919]]
X_linear = 30
Y_calculated = linear_interpolation(tab_linear, X_linear)
print(f"Линейная интерполяция: Задаем X = {X_linear}, Получаем Y = {Y_calculated:.3f}\n")

# Данные для билинейной интерполяции
tab_bilinear = [
    [35, 33, 30, 25],
    [20, 50, 100, 150, 200],
    [ # Z-значения (4 ряда по X, 5 столбцов по Y)
        [6.549, 7.211, 8.88, 10.945, 13.409],
        [5.9, 6.499, 8.018, 9.927, 12.214],
        [5.036, 5.552, 6.872, 8.572, 10.622],
        [3.851, 4.257, 5.299, 6.712, 8.438]
    ]
]
X_bilinear = 27
Y_bilinear = 112
Z_bilinear_calculated = bilinear_interpolation(tab_bilinear, X_bilinear, Y_bilinear)
print(f"Билинейная интерполяция: Задаем X = {X_bilinear}, Y = {Y_bilinear}, Получаем Z = {Z_bilinear_calculated:.3f}\n")


# Данные для линейно-билинейной интерполяции
tab_1_lb = [
    [9000],
    [35, 33, 30, 25],
    [20, 50, 100, 150, 200],
    [ # Z-значения для A1
        [6.549, 7.211, 8.88, 10.945, 13.409],
        [5.9, 6.499, 8.018, 9.927, 12.214],
        [5.036, 5.552, 6.872, 8.572, 10.622],
        [3.851, 4.257, 5.299, 6.712, 8.438]
    ]
]
tab_2_lb = [
    [8000],  # A2
    [35, 33, 30, 25],
    [20, 50, 100, 150, 200],
    [ # Z-значения для A2
        [6.635, 7.384, 9.285, 11.678, 14.582],
        [5.979, 6.655, 8.384, 10.591, 13.28],
        [5.104, 5.687, 7.184, 9.144, 11.546],
        [3.906, 4.362, 5.539, 7.158, 9.169]
    ]
]
X_lb = 27
Y_lb = 112
A_lb = 8800
Z_lb_calculated = linear_bilinear_interpolation(tab_1_lb, tab_2_lb, X_lb, Y_lb, A_lb)
print(f"Линейно-билинейная интерполяция: Задаем X = {X_lb}, Y = {Y_lb}, A = {A_lb}, Получаем Z = {Z_lb_calculated:.3f}")